// 数组的定义

// 创建数组的方式有哪些？？

// 什么是稀疏数组，非稀疏数组？ 如何判断？

// 数组的 增 删 （删插替）复制粘贴  拼接数组  查 取数组元素  扁平化 填充

// 数组的排序 翻转

// 数组的遍历

// 数组去重，取出随机数组元素

// 检测是否为数组

// 数组的拷贝

// 对象属性  方法的简写

// 对象属性的几个特征

// 定义对象的方式有 对象直接量, 构造函数, new Object(), Object.create()

// 对象的原型链, 及对象间的继承方式
// Obj.prototype   Obj.__proto__  Obj.isPrototypeOf()  Object.getPrototypeOf()  Object.setPrototypeOf()


// 对象属性的来源：
// 对象属性的4个特质：可读 可写 可枚举 可配置
// 查询一个对象上某个属性的 四个特性  getOwnPropertyDescriptor
// 定义/检测对象是否可扩展的 四个 方法：preventExtensions seal  isSealed  freeze  isFrozen 

// 对象间的继承：原型链式继承  类式继承  组合式继承  原型式继承  寄生式继承 寄生组合式继承

// 对象实例的创建方式：

// 函数的定义，函数和对象间的关系

// 函数声明， 函数表达式及他们之间的区别

// 函数调用方式哪几种

// 闭包

// 递归函数

// 纯函数

// 立即调用函数表达式
// 函数作用域